webpackJsonp([33],{

/***/ 1:
/***/ (function(module, exports) {

// removed by extract-text-webpack-plugin

/***/ }),

/***/ 130:
/***/ (function(module, __webpack_exports__, __webpack_require__) {

"use strict";
Object.defineProperty(__webpack_exports__, "__esModule", { value: true });
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_0_vue__ = __webpack_require__(4);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_0_vue___default = __webpack_require__.n(__WEBPACK_IMPORTED_MODULE_0_vue__);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_1__app_vue__ = __webpack_require__(61);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_1__app_vue___default = __webpack_require__.n(__WEBPACK_IMPORTED_MODULE_1__app_vue__);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_2_assets_css_mui_min_css__ = __webpack_require__(3);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_2_assets_css_mui_min_css___default = __webpack_require__.n(__WEBPACK_IMPORTED_MODULE_2_assets_css_mui_min_css__);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_3_assets_css_public_css__ = __webpack_require__(1);
/* harmony import */ var __WEBPACK_IMPORTED_MODULE_3_assets_css_public_css___default = __webpack_require__.n(__WEBPACK_IMPORTED_MODULE_3_assets_css_public_css__);




__WEBPACK_IMPORTED_MODULE_0_vue___default.a.config.productionTip = false;
new __WEBPACK_IMPORTED_MODULE_0_vue___default.a({
    el: '#app',
    render: function render(h) {
        return h(__WEBPACK_IMPORTED_MODULE_1__app_vue___default.a);
    }
});

/***/ }),

/***/ 171:
/***/ (function(module, exports) {

// removed by extract-text-webpack-plugin

/***/ }),

/***/ 219:
/***/ (function(module, exports) {

module.exports={render:function (){var _vm=this;var _h=_vm.$createElement;var _c=_vm._self._c||_h;
  return _vm._m(0)
},staticRenderFns: [function (){var _vm=this;var _h=_vm.$createElement;var _c=_vm._self._c||_h;
  return _c('div', [_c('header', {
    staticClass: "mui-bar mui-bar-nav"
  }, [_c('a', {
    staticClass: "mui-action-back mui-icon mui-icon-left-nav mui-pull-left"
  }), _vm._v(" "), _c('h1', {
    staticClass: "mui-title"
  }, [_vm._v("用户协议")])]), _vm._v(" "), _c('div', {
    staticClass: "mui-content"
  }, [_c('div', {
    staticClass: "textbox"
  }, [_vm._v("\n        一、总则\n        "), _c('br'), _vm._v(" 1.1搞起的所有权和运营权归北京华游竞界科技发展有限公司所有。\n        "), _c('br'), _vm._v(" 1.2用户在使用本平台的服务之前，应该仔细阅读本协议，并同意遵守本协议及所有平台规则后方可成为搞起用户，一旦用户注册成功，则用户与本平台之间自动形成协议关系，用户应当受本协议及所有平台规则的约束。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。\n        "), _c('br'), _vm._v(" 1.3本平台规则可由本平台随时更新，用户在使用搞起产品时应当及时关注，用户同意本平台不承担通知义务。本平台的通知、公告、声明或其它类似内容是本协议及平台规则的一部分。\n        "), _c('br'), _vm._v(" 二、服务内容\n        "), _c('br'), _vm._v(" 2.1本平台服务的具体内容由本平台根据实际情况提供，例问答、动态等。\n        "), _c('br'), _vm._v(" 2.2本平台仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。\n        "), _c('br'), _vm._v(" 三、用户账号\n\n        "), _c('br'), _vm._v(" 3.1用户可通过以下方式注册成为搞起的正式用户： 经本平台会员系统完成注册程序并通过身份认证的用户；成为搞起正式用户即获得本平台规定用户所应享有的一切权限；未经认证仅享有本平台规定的部分会员权限。搞起有权对会员的权限设计进行变更。\n        "), _c('br'), _vm._v(" 3.2用户账号注册\n        "), _c('br'), _vm._v(" 使用本平台会员系统注册的用户，只能使用手机号进行注册，否则将不予注册，通过微信和QQ快速登录的用户在使用本APP功能前需填写手机号码等完善信息。\n        "), _c('br'), _vm._v(" 3.3如发现用户呢称中含有不雅文字或不恰当名称的、本平台保留取消其用户资格的权利。\n        "), _c('br'), _vm._v(" (1)请勿以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；\n        "), _c('br'), _vm._v(" (2)请勿以国家机构或其他机构的名称注册；\n        "), _c('br'), _vm._v(" (3)请勿注册不文明、不健康名字、或包含歧视、侮辱、猥琐类词语的帐号；\n        "), _c('br'), _vm._v(" (4)请勿注册易产生歧义、引起他人误解或其它不符合法律规定 的账号。\n        "), _c('br'), _vm._v(" 3.4用户账号的所有权归本平台，用户仅享有使用权。3个月未 使用的用户帐号，本平台保留收回的权利。\n        "), _c('br'), _vm._v(" 3.5用户有义务保证密码和帐号的安全，用户利用该密码和帐号 所进行的一切活动引起的任何损失或损害，由用户自行承担全部 责任，本平台不承担任何责任。如用户发现帐号遭到未授权的使 用或发生其他任何安全问题，应立即修改帐号密码并妥善保管， 如有必要，请通知本平台。因黑客行为或用户的保管疏忽导致帐 号非法使用，本平台不承担任何责任。\n        "), _c('br'), _vm._v(" 四、使用规则\n\n        "), _c('br'), _vm._v(" 4.1遵守中华人民共和国相关法律法规，包括但不限于《中华人 民共和国计算机信息系统安全保护条例》、《计算机软件保护条 例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件 适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委 会关于维护互联网安全的决定》、《互联网电子公告服务管理规 定》、《互联网新闻信息服务管理规定》、《互联网著作权行政 保护办法》和《信息网络传播权保护条例》等有关计算机互联网 规定和知识产权的法律和法规、实施办法。\n        "), _c('br'), _vm._v(" 4.2用户对其自行发表、上传或传送的内容负全部责任，所有用 户不得在本平台任何页面发布、转载、传送含有下列内容之一的 信息，否则本平台有权自行处理并不通知用户：\n        "), _c('br'), _vm._v(" (1)违反宪法确定的基本原则的；\n        "), _c('br'), _vm._v(" (2)危害国家安全，泄露国家机密，颠覆国家政权，破坏国家统 一的；\n        "), _c('br'), _vm._v(" (3)损害国家荣誉和利益的；\n        "), _c('br'), _vm._v(" (4)煽动民族仇恨，民族歧视，破坏民族团结的；\n        "), _c('br'), _vm._v(" (5)破坏国家宗教政策，宣扬邪教和封建迷信的；\n        "), _c('br'), _vm._v(" (6)散布谣言，扰乱社会秩序，破坏社会稳定的；\n        "), _c('br'), _vm._v(" (7)散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；\n        "), _c('br'), _vm._v(" (8)侮辱或者诽谤他人，侵害他人合法权益的；\n        "), _c('br'), _vm._v(" (9)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；\n        "), _c('br'), _vm._v(" (10)以非法民间组织名义活动的；\n        "), _c('br'), _vm._v(" (11)含有法律、行政法规禁止的其他内容的。\n        "), _c('br'), _vm._v(" 4.3用户承诺对其发表或者上传于本平台的所有信息(即属于 《中华人民共和国著作权法》规定的作品，包括但不限于文字、 图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有 完整的知识产权，或者已经得到相关权利人的合法授权；如用户 违反本条规定造成本平台被第三人索赔的，用户应全额补偿本平 台一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出 的其它合理费用)；\n        "), _c('br'), _vm._v(" 4.4当第三方认为用户发表或者上传于本平台的信息侵犯其权 利，并根据《信息网络传播权保护条例》或者相关法律规定向本 平台发送权利通知书时，用户同意本平台可以自行判断决定删除 涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性， 本平台将不会自动恢复上述删除的信息；\n        "), _c('br'), _vm._v(" (1)不得为任何非法目的而使用网络服务系统；\n        "), _c('br'), _vm._v(" (2)遵守所有与网络服务有关的网络协议、规定和程序；\n        "), _c('br'), _vm._v(" (3)不得利用本平台服务进行任何可能对互联网的正常运转造成 不利影响的行为；\n        "), _c('br'), _vm._v(" (4)不得利用本平台服务进行任何不利于本平台的行为。\n        "), _c('br'), _vm._v(" 4.5如用户在使用网络服务时违反上述任何规定，本平台有权要 求用户改正或直接采取一切必要的措施(包括但不限于删除用户 张贴的内容、暂停或终止用户使用网络服务的权利)以减轻用户 不当行为而造成的影响。\n        "), _c('br'), _vm._v(" 五、隐私保护\n\n        "), _c('br'), _vm._v(" 5.1本平台不对外公开或向第三方提供单个用户的注册资料及用 户在使用网络服务时存储在本平台的非公开内容，但下列情况除 外：\n        "), _c('br'), _vm._v(" (1)事先获得用户的明确授权；\n        "), _c('br'), _vm._v(" (2)根据有关的法律法规要求；\n        "), _c('br'), _vm._v(" (3)按照相关政府主管部门的要求；\n        "), _c('br'), _vm._v(" (4)为维护社会公众的利益。\n        "), _c('br'), _vm._v(" 5.2本平台可能会与第三方合作向用户提供相关的网络服务，在 此情况下，如该第三方同意承担与本平台同等的保护用户隐私的 责任，则本平台有权将用户的注册资料等提供给该第三方。 5.3在不透露单个用户隐私资料的前提下，本平台有权对整个用 户数据库进行分析并对用户数据库进行商业上的利用。\n        "), _c('br'), _vm._v(" 六、版权声明\n\n        "), _c('br'), _vm._v(" 6.1用户发表并将其上传到本网站的任何内容，本平台在全世界 范围内不限形式和载体地享有永久的、不可撤销的、免费的、非 独家的使用权和转授权的权利，包括但不限于修改、复制、发 行、展览、改编、汇编、出版、翻译、信息网络传播、广播、表 演和再创作及著作权法等法律法规确定的其他权利。\n        "), _c('br'), _vm._v(" 6.2本平台特有的标识、版面设计、编排方式等版权均属本平台 享有，未经本平台许可，不得任意复制或转载。\n        "), _c('br'), _vm._v(" 6.3本平台特有的头衔系统所涉及的名称，描述文字，计算公式与 排名办法等版权均属本平台享有，未经本平台许可，不得任意使 用，复制或转载。\n        "), _c('br'), _vm._v(" 6.4用户从本平台的服务中获得的信息，未经本平台许可，不得 任意复制或转载。\n        "), _c('br'), _vm._v(" 6.5使用本平台的任何内容均应注明\"来源于搞起\"及署上作者姓 名，按法律规定需要支付稿酬的，应当通知本平台及作者及支付 稿酬，并独立承担一切法律责任。\n        "), _c('br'), _vm._v(" 6.6本平台享有所有作品用于其它用途的使用权和优先权，包括 但不限于网站、电子杂志、平面出版等，作者在本平台发布内容 时视为同意本条款。\n        "), _c('br'), _vm._v(" 6.7本平台所有内容仅代表作者自己的立场和观点，与本平台无 关，由作者本人承担一切法律责任。\n        "), _c('br'), _vm._v(" 6.8恶意转载本平台内容的，本平台保留将其诉诸法律的权利。\n        "), _c('br'), _vm._v(" 七、责任声明 7.1用户明确同意其使用本平台网络服务所存在的风险及一切后 果将完全由用户本人承担，本平台对此不承担任何责任。 7.2本平台无法保证网络服务一定能满足用户的需求，也不保证 网络服务的及时性、安全性、准确性。\n        "), _c('br'), _vm._v(" 7.3本平台不保证为方便用户而设置的外部链接的准确性和完整 性，同时，对于该等外部链接指向的不由本平台实际控制的任何 网页上的内容，本平台不承担任何责任。\n        "), _c('br'), _vm._v(" 7.4对于因不可抗力或本平台不能控制的原因造成的网络服务中 断或其它缺陷，本平台不承担任何责任，但将尽力减少因此而给 用户造成的损失和影响。\n        "), _c('br'), _vm._v(" 7.5对于本平台向用户提供的下列产品或者服务的质量缺陷本事 及其引发的任何损失，本平台无需承担任何责任：\n        "), _c('br'), _vm._v(" (1)本平台向用户免费提供的各项网络服务；\n        "), _c('br'), _vm._v(" (2)本平台向用户赠送的任何产品或者服务；\n        "), _c('br'), _vm._v(" (3)本平台向收费网络服务用户附赠的各种产品或者服务。\n        "), _c('br'), _vm._v(" 7.6本平台有权于任何时间暂时或永久修改或终止本服务(或其任 何部分），而无论其通知与否，本平台对用户和任何第三人均无 需承担任何责任。\n        "), _c('br'), _vm._v(" 八、附则\n\n        "), _c('br'), _vm._v(" 8.1本协议的订立、执行和解释及争议的解决均应适用中华人民 共和国法律。\n        "), _c('br'), _vm._v(" 8.2如本协议中的任何条款无论因何种原因完全或部分无效或不 具有执行力，本协议的其余条款仍应有效并且有约束力。\n        "), _c('br'), _vm._v(" 8.3如本协议解释权及修订权归搞起平台所有。\n\n    ")])])])
}]}

/***/ }),

/***/ 61:
/***/ (function(module, exports, __webpack_require__) {


/* styles */
__webpack_require__(171)

var Component = __webpack_require__(8)(
  /* script */
  __webpack_require__(95),
  /* template */
  __webpack_require__(219),
  /* scopeId */
  null,
  /* cssModules */
  null
)

module.exports = Component.exports


/***/ }),

/***/ 95:
/***/ (function(module, __webpack_exports__, __webpack_require__) {

"use strict";
Object.defineProperty(__webpack_exports__, "__esModule", { value: true });
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//

/* harmony default export */ __webpack_exports__["default"] = ({});

/***/ })

},[130]);
//# sourceMappingURL=agreement.js.map